In [3]:
# 데이터 베이스의 테이블에서 데이터를 읽어와 데이터 프레임으로 생성한다.
# pymysql, cryptography 필요
# pip install pymysql
# pip install cryptography

import pymysql
import numpy as np
import pandas as pd

# 데이터 베이스 접속 정보를 관리하는 객체
db_connector = pymysql.connect(
    # DBMS가 설치되어 있는 컴퓨터의 도메인 주소나 IP 주소
    host = '127.0.0.1',
    # DBMS에 접속하기 위한 port 번호
    port = 3306,
    # 접속할 계정
    user = 'root',
    # 접속 계정의 비밀번호
    password = 'angel1030!',
    # 사용할 데이터 베이스의 이름
    db = 'employees',
    # 인코딩 타입
    charset='utf8'
)

In [4]:
sql = 'select * from employees'
employees_df = pd.read_sql(sql, db_connector)

sql = "select * from departments"
departments_df = pd.read_sql(sql, db_connector)

sql = "select * from dept_emp"
dept_emp_df = pd.read_sql(sql, db_connector)

sql = "select * from dept_manager"
dept_manager_df = pd.read_sql(sql, db_connector)

sql = "select * from salaries"
salaries_df = pd.read_sql(sql, db_connector)

sql = "select * from titles"
titles_df = pd.read_sql(sql, db_connector)

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/2785603514.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employees_df = pd.read_sql(sql, db_connector)
/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/2785603514.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  departments_df = pd.read_sql(sql, db_connector)
/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/2785603514.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  dept_emp_df = pd.read_sql(sql, db_connector)
/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/2785603514.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  dept_manager_df = pd.read_sql(sql, db_connector)
/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/2785603514.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  salaries_df = pd.read_sql(sql, db_connector)
/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/2785603514.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  titles_df = pd.read_sql(sql, db_connector)

In [5]:
display(employees_df)
display(departments_df)
display(dept_emp_df)
display(dept_manager_df)
display(salaries_df)
display(titles_df)

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

  dept_no           dept_name
0    d009    Customer Service
1    d005         Development
2    d002             Finance
3    d003     Human Resources
4    d001           Marketing
5    d004          Production
6    d006  Quality Management
7    d008            Research
8    d007               Sales

        emp_no dept_no   from_date     to_date
0        10001    d005  1986-06-26  9999-01-01
1        10002    d007  1996-08-03  9999-01-01
2        10003    d004  1995-12-03  9999-01-01
3        10004    d004  1986-12-01  9999-01-01
4        10005    d003  1989-09-12  9999-01-01
...        ...     ...         ...         ...
331598  499995    d004  1997-06-02  9999-01-01
331599  499996    d004  1996-05-13  9999-01-01
331600  499997    d005  1987-08-30  9999-01-01
331601  499998    d002  1993-12-27  9999-01-01
331602  499999    d004  1997-11-30  9999-01-01

[331603 rows x 4 columns]

    emp_no dept_no   from_date     to_date
0   110022    d001  1985-01-01  1991-10-01
1   110039    d001  1991-10-01  9999-01-01
2   110085    d002  1985-01-01  1989-12-17
3   110114    d002  1989-12-17  9999-01-01
4   110183    d003  1985-01-01  1992-03-21
5   110228    d003  1992-03-21  9999-01-01
6   110303    d004  1985-01-01  1988-09-09
7   110344    d004  1988-09-09  1992-08-02
8   110386    d004  1992-08-02  1996-08-30
9   110420    d004  1996-08-30  9999-01-01
10  110511    d005  1985-01-01  1992-04-25
11  110567    d005  1992-04-25  9999-01-01
12  110725    d006  1985-01-01  1989-05-06
13  110765    d006  1989-05-06  1991-09-12
14  110800    d006  1991-09-12  1994-06-28
15  110854    d006  1994-06-28  9999-01-01
16  111035    d007  1985-01-01  1991-03-07
17  111133    d007  1991-03-07  9999-01-01
18  111400    d008  1985-01-01  1991-04-08
19  111534    d008  1991-04-08  9999-01-01
20  111692    d009  1985-01-01  1988-10-17
21  111784    d009  1988-10-17  1992-09-08
22  111877    d009  1992-09-08  1996-01-03
23  111939    d009  1996-01-03  9999-01-01

         emp_no  salary   from_date     to_date
0         10001   60117  1986-06-26  1987-06-26
1         10001   62102  1987-06-26  1988-06-25
2         10001   66074  1988-06-25  1989-06-25
3         10001   66596  1989-06-25  1990-06-25
4         10001   66961  1990-06-25  1991-06-25
...         ...     ...         ...         ...
2844042  499999   63707  1997-11-30  1998-11-30
2844043  499999   67043  1998-11-30  1999-11-30
2844044  499999   70745  1999-11-30  2000-11-29
2844045  499999   74327  2000-11-29  2001-11-29
2844046  499999   77303  2001-11-29  9999-01-01

[2844047 rows x 4 columns]

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [6]:
# display(employees_df)
# display(departments_df)
# display(dept_emp_df)
# display(dept_manager_df)
# display(salaries_df)
# display(titles_df)
employees_df['birth_date'] = pd.to_datetime(employees_df['birth_date'])
employees_df['hire_date'] = pd.to_datetime(employees_df['hire_date'])

dept_emp_df['from_date'] = pd.to_datetime(dept_emp_df['from_date'])
dept_emp_df['to_date'] = dept_emp_df['to_date'].astype('str')
idx = dept_emp_df.query('to_date == "9999-01-01"').index
dept_emp_df.loc[idx, 'to_date'] = '2222-01-01'
dept_emp_df['to_date'] = pd.to_datetime(dept_emp_df['to_date'])

dept_manager_df['from_date'] = pd.to_datetime(dept_manager_df['from_date'])
dept_manager_df['to_date'] = dept_manager_df['to_date'].astype('str')
idx = dept_manager_df.query('to_date == "9999-01-01"').index
dept_manager_df.loc[idx, 'to_date'] = '2222-01-01'
dept_manager_df['to_date'] = pd.to_datetime(dept_manager_df['to_date'])

salaries_df['from_date'] = pd.to_datetime(salaries_df['from_date'])
salaries_df['to_date'] = salaries_df['to_date'].astype('str')
idx = salaries_df.query('to_date == "9999-01-01"').index
salaries_df.loc[idx, 'to_date'] = '2222-01-01'
salaries_df['to_date'] = pd.to_datetime(salaries_df['to_date'])

titles_df['from_date'] = pd.to_datetime(titles_df['from_date'])
titles_df['to_date'] = titles_df['to_date'].astype('str')
idx = titles_df.query('to_date == "9999-01-01"').index
titles_df.loc[idx, 'to_date'] = '2222-01-01'
titles_df['to_date'] = pd.to_datetime(titles_df['to_date'])

In [7]:
employees_df.info()
print('--------------------------------')
departments_df.info()
print('--------------------------------')
dept_emp_df.info()
print('--------------------------------')
dept_manager_df.info()
print('--------------------------------')
salaries_df.info()
print('--------------------------------')
titles_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  datetime64[ns]
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(3)
memory usage: 13.7+ MB
--------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   dept_no    9 non-null      object
 1   dept_name  9 non-null      object
dtypes: object(2)
memory usage: 276.0+ bytes
--------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331603 entries, 0 to 331602
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     331603 non-null  int64
 1   dept_no    331603 non-null  object
 2   from_date  331603 non-null  datetime64[ns]
 3   to_date    331603 non-null  datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(1)
memory usage: 10.1+ MB
--------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   emp_no     24 non-null     int64
 1   dept_no    24 non-null     object
 2   from_date  24 non-null     datetime64[ns]
 3   to_date    24 non-null     datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(1)
memory usage: 900.0+ bytes
--------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2844047 entries, 0 to 2844046
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   emp_no     int64
 1   salary     int64
 2   from_date  datetime64[ns]
 3   to_date    datetime64[ns]
dtypes: datetime64[ns](2), int64(2)
memory usage: 86.8 MB
--------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  datetime64[ns]
 3   to_date    443308 non-null  datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(1)
memory usage: 13.5+ MB

In [ ]:
# -- 부서의 모든 정보를 가져온다.
departments_df

  dept_no           dept_name
0    d009    Customer Service
1    d005         Development
2    d002             Finance
3    d003     Human Resources
4    d001           Marketing
5    d004          Production
6    d006  Quality Management
7    d008            Research
8    d007               Sales

In [ ]:
# -- 매니저의 모든 정보를 가져온다.
dept_manager_df

    emp_no dept_no  from_date    to_date
0   110022    d001 1985-01-01 1991-10-01
1   110039    d001 1991-10-01 2222-01-01
2   110085    d002 1985-01-01 1989-12-17
3   110114    d002 1989-12-17 2222-01-01
4   110183    d003 1985-01-01 1992-03-21
5   110228    d003 1992-03-21 2222-01-01
6   110303    d004 1985-01-01 1988-09-09
7   110344    d004 1988-09-09 1992-08-02
8   110386    d004 1992-08-02 1996-08-30
9   110420    d004 1996-08-30 2222-01-01
10  110511    d005 1985-01-01 1992-04-25
11  110567    d005 1992-04-25 2222-01-01
12  110725    d006 1985-01-01 1989-05-06
13  110765    d006 1989-05-06 1991-09-12
14  110800    d006 1991-09-12 1994-06-28
15  110854    d006 1994-06-28 2222-01-01
16  111035    d007 1985-01-01 1991-03-07
17  111133    d007 1991-03-07 2222-01-01
18  111400    d008 1985-01-01 1991-04-08
19  111534    d008 1991-04-08 2222-01-01
20  111692    d009 1985-01-01 1988-10-17
21  111784    d009 1988-10-17 1992-09-08
22  111877    d009 1992-09-08 1996-01-03
23  111939    d009 1996-01-03 2222-01-01

In [11]:
# -- 사원의 모든 정보를 가져온다.
employees_df

        emp_no birth_date first_name last_name gender  hire_date
0        10001 1953-09-02     Georgi   Facello      M 1986-06-26
1        10002 1964-06-02    Bezalel    Simmel      F 1985-11-21
2        10003 1959-12-03      Parto   Bamford      M 1986-08-28
3        10004 1954-05-01  Chirstian   Koblick      M 1986-12-01
4        10005 1955-01-21    Kyoichi  Maliniak      M 1989-09-12
...        ...        ...        ...       ...    ...        ...
300019  499995 1958-09-24     Dekang  Lichtner      F 1993-01-12
300020  499996 1953-03-07       Zito      Baaz      M 1990-09-27
300021  499997 1961-08-03    Berhard    Lenart      M 1986-04-21
300022  499998 1956-09-05   Patricia   Breugel      M 1993-10-13
300023  499999 1958-05-01     Sachin   Tsukuda      M 1997-11-30

[300024 rows x 6 columns]

In [ ]:
# -- 사원의 번호와 사원의 급여액을 가져온다.
salaries_df[['emp_no','salary']]

         emp_no  salary
0         10001   60117
1         10001   62102
2         10001   66074
3         10001   66596
4         10001   66961
...         ...     ...
2844042  499999   63707
2844043  499999   67043
2844044  499999   70745
2844045  499999   74327
2844046  499999   77303

[2844047 rows x 2 columns]

In [ ]:
# -- 사원 번호와 근무하고 있는 부서 번호를 가져온다.
dept_emp_df.query('to_date == "2222-01-01"')[['emp_no','dept_no']]

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/4013144831.py:2: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  dept_emp_df.query('to_date == "2222-01-01"')[['emp_no','dept_no']]

        emp_no dept_no
0        10001    d005
1        10002    d007
2        10003    d004
3        10004    d004
4        10005    d003
...        ...     ...
331598  499995    d004
331599  499996    d004
331600  499997    d005
331601  499998    d002
331602  499999    d004

[240124 rows x 2 columns]

In [ ]:
# -- 매니저 사원의 번호와 근무하고 있는 부서 번호를 가져온다.
dept_manager_df.query('to_date == "2222-01-01"')[['emp_no','dept_no']]

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/4109827874.py:2: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  dept_manager_df.query('to_date == "2222-01-01"')[['emp_no','dept_no']]

    emp_no dept_no
1   110039    d001
3   110114    d002
5   110228    d003
9   110420    d004
11  110567    d005
15  110854    d006
17  111133    d007
19  111534    d008
23  111939    d009

In [ ]:
# -- 사원의 번호와 생년월일, 성별, 입사일을 가져온다.
employees_df[['emp_no','birth_date','gender','hire_date']]

        emp_no birth_date gender  hire_date
0        10001 1953-09-02      M 1986-06-26
1        10002 1964-06-02      F 1985-11-21
2        10003 1959-12-03      M 1986-08-28
3        10004 1954-05-01      M 1986-12-01
4        10005 1955-01-21      M 1989-09-12
...        ...        ...    ...        ...
300019  499995 1958-09-24      F 1993-01-12
300020  499996 1953-03-07      M 1990-09-27
300021  499997 1961-08-03      M 1986-04-21
300022  499998 1956-09-05      M 1993-10-13
300023  499999 1958-05-01      M 1997-11-30

[300024 rows x 4 columns]

In [ ]:
# -- 사원의 번호와 급여액을 가져온다. 급여액은 2000씩 인상된 금액으로 가져온다.
salaries_df[['emp_no']].assign(salary_ =salaries_df[['salary']]+2000 )

         emp_no  salary  salary_
0         10001   60117    62117
1         10001   62102    64102
2         10001   66074    68074
3         10001   66596    68596
4         10001   66961    68961
...         ...     ...      ...
2844042  499999   63707    65707
2844043  499999   67043    69043
2844044  499999   70745    72745
2844045  499999   74327    76327
2844046  499999   77303    79303

[2844047 rows x 3 columns]

In [ ]:
# -- 사원의 번호와 급여액을 가져온다. 급여액의 3배가 인상된 금액으로 가져온다.
salaries_df[['emp_no']].assign(salary_ =salaries_df[['salary']]*3 )

         emp_no  salary_
0         10001   180351
1         10001   186306
2         10001   198222
3         10001   199788
4         10001   200883
...         ...      ...
2844042  499999   191121
2844043  499999   201129
2844044  499999   212235
2844045  499999   222981
2844046  499999   231909

[2844047 rows x 2 columns]

In [ ]:
# -- 사원의 번호와 급여액을 가져온다. 급여액에서 3000씩 인하된 금액을 가져온다.
salaries_df[['emp_no']].assign(salary_ =salaries_df[['salary']]-3000 )

         emp_no  salary_
0         10001    57117
1         10001    59102
2         10001    63074
3         10001    63596
4         10001    63961
...         ...      ...
2844042  499999    60707
2844043  499999    64043
2844044  499999    67745
2844045  499999    71327
2844046  499999    74303

[2844047 rows x 2 columns]

In [ ]:
# -- 사원의 번호와 급여액을 가져온다. 2000 인상된 급여액, 1000 인하된 급여액을 가져온다.
salaries_df[['emp_no']].assign(salary_ = salaries_df[['salary']]+2000, _salary =  salaries_df[['salary']]-1000)

         emp_no  salary_  _salary
0         10001    62117    59117
1         10001    64102    61102
2         10001    68074    65074
3         10001    68596    65596
4         10001    68961    65961
...         ...      ...      ...
2844042  499999    65707    62707
2844043  499999    69043    66043
2844044  499999    72745    69745
2844045  499999    76327    73327
2844046  499999    79303    76303

[2844047 rows x 3 columns]

In [ ]:
# -- 현재 d001 부서와 d002 부서에 근무하고 있는 사원들의 사원번호, 근무 부서 번호를 가져온다.
dept_emp_df.query('(dept_no == "d001" or dept_no == "d002") and to_date == "2222-01-01"')[['emp_no', 'dept_no']]

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/2203922041.py:2: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  dept_emp_df.query('(dept_no == "d001" or dept_no == "d002") and to_date == "2222-01-01"')[['emp_no', 'dept_no']]

        emp_no dept_no
17       10017    d001
62       10058    d001
63       10059    d002
144      10132    d002
153      10140    d001
...        ...     ...
331568  499968    d001
331570  499970    d001
331578  499977    d002
331594  499992    d001
331601  499998    d002

[27279 rows x 2 columns]

In [ ]:
# -- 과거에 d003 부서에 근무한 적이 있는 모든 사원들의 사원번호와 근무 종료일을 가져온다(현재는 포함하지 않는다)
dept_emp_df.query('dept_no == "d003" and to_date != "2222-01-01"')[['emp_no','to_date']]

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/3380158878.py:2: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  dept_emp_df.query('dept_no == "d003" and to_date != "2222-01-01"')[['emp_no','to_date']]

        emp_no    to_date
114      10105 2001-06-11
118      10108 1999-12-06
158      10144 1993-08-10
390      10354 2002-01-01
398      10362 1997-07-16
...        ...        ...
331369  499788 1995-03-30
331449  499861 1998-07-23
331556  499957 1992-11-28
331576  499975 1996-10-19
331595  499992 1995-05-31

[4888 rows x 2 columns]

In [ ]:
# -- 현재 매니저를 담당하고 있는 사원들의 사원 번호와 근무 부서 번호를 가져온다.
dept_manager_df.query('to_date == "2222-01-01"')[['emp_no','dept_no']]

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/1828967568.py:2: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  dept_manager_df.query('to_date == "2222-01-01"')[['emp_no','dept_no']]

    emp_no dept_no
1   110039    d001
3   110114    d002
5   110228    d003
9   110420    d004
11  110567    d005
15  110854    d006
17  111133    d007
19  111534    d008
23  111939    d009

In [ ]:
# -- d003 부서에서 매니저를 담당적이 있던 모든 사람들의 사원번호와 매니저 종료일을 가져온다(현재는 포함하지 않는다)
dept_manager_df.query('dept_no == "d003" and to_date != "2222-01-01"')[['emp_no','to_date']]

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/4197656573.py:2: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  dept_manager_df.query('dept_no == "d003" and to_date != "2222-01-01"')[['emp_no','to_date']]

   emp_no    to_date
4  110183 1992-03-21

In [ ]:
# -- 1960년대에 태어난 사원들의 사원번호 생년월일을 가져온다.
employees_df.query('birth_date >= "1960-01-01" and birth_date <= "1969-12-31"')[['emp_no', 'birth_date']]

        emp_no birth_date
1        10002 1964-06-02
9        10010 1963-06-01
11       10012 1960-10-04
12       10013 1963-06-07
15       10016 1961-05-02
...        ...        ...
300014  499990 1963-11-03
300015  499991 1962-02-26
300016  499992 1960-10-12
300017  499993 1963-06-04
300021  499997 1961-08-03

[117138 rows x 2 columns]

In [ ]:
# -- 입사일이 1980년 01월 01일 이후(포함)인 사원들 중에 여자 사원들의 사원번호, 입사일, 성별을 가져온다.
employees_df.query('hire_date >="1980-01-01" and gender == "F"')[['emp_no','hire_date','gender']]

        emp_no  hire_date gender
1        10002 1985-11-21      F
5        10006 1989-06-02      F
6        10007 1989-02-10      F
8        10009 1985-02-18      F
9        10010 1989-08-24      F
...        ...        ...    ...
300012  499988 1986-06-06      F
300015  499991 1989-01-12      F
300016  499992 1987-05-10      F
300018  499994 1990-04-24      F
300019  499995 1993-01-12      F

[120051 rows x 3 columns]

In [ ]:
# -- first_name이 Mary인 사원들과 Chirstian 인 사원들의 사원 번호와 last_name을 가져온다.
employees_df.query('first_name == "Mary" or first_name == "Chirstian"')[['emp_no','last_name']]

        emp_no  last_name first_name
3        10004    Koblick  Chirstian
10       10011      Sluis       Mary
531      10532    Wossner       Mary
1820     11821     Piazza       Mary
2333     12334       Ertl       Mary
...        ...        ...        ...
296284  496260  Showalter       Mary
297153  497129       Penn       Mary
297741  497717    Tiemann       Mary
298319  498295       Luef  Chirstian
298537  498513     Mahmud  Chirstian

[450 rows x 3 columns]

In [ ]:
# -- 현재 받고 있는 급여가 100000 이상인 사원들의 사원 번호와 급여액을 가져온다.
salaries_df.query('salary >= 100000 and to_date == "2222-01-01"')[['emp_no','salary']]

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/4264068435.py:2: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  salaries_df.query('salary >= 100000 and to_date == "2222-01-01"')[['emp_no','salary']]

         emp_no  salary
652       10066  103672
683       10068  113229
1047      10107  101676
1457      10150  100182
1467      10151  109501
...         ...     ...
2843652  499953  114876
2843820  499970  118576
2843868  499976  107386
2843891  499980  108364
2843950  499986  119906

[17499 rows x 2 columns]

In [ ]:
# -- 현재 받고 있는 급여가 100000 이하인 사원들의 사원 번호와 급여액을 가져온다.
salaries_df.query('salary <= 100000 and to_date == "2222-01-01"')[['emp_no','salary']]

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/717002099.py:2: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  salaries_df.query('salary <= 100000 and to_date == "2222-01-01"')[['emp_no','salary']]

         emp_no  salary
16        10001   88958
22        10002   72527
29        10003   43311
45        10004   74057
58        10005   94692
...         ...     ...
2844010  499995   52868
2844017  499996   69501
2844032  499997   83441
2844041  499998   55003
2844046  499999   77303

[222627 rows x 2 columns]

In [40]:
# -- 현재 받고 있는 급여가 100000 이상 200000 이하인 사원들의 사원 번호와 급여액을 가져온다.
salaries_df.query('salary >= 100000 and salary <= 200000 and to_date == "2222-01-01"')[['emp_no','salary']]

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/3464295543.py:2: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  salaries_df.query('salary >= 100000 and salary <= 200000 and to_date == "2222-01-01"')[['emp_no','salary']]

         emp_no  salary
652       10066  103672
683       10068  113229
1047      10107  101676
1457      10150  100182
1467      10151  109501
...         ...     ...
2843652  499953  114876
2843820  499970  118576
2843868  499976  107386
2843891  499980  108364
2843950  499986  119906

[17499 rows x 2 columns]

In [ ]:
# -- 현재 직함이 Staff 이거나 Engineer 이거나 Manager인 사원들의 사원번호와 직함을 가져온다.
titles_df.query('title == "Staff" or title == "Engineer" or title == "Manager"')[['emp_no','title']]

        emp_no     title
1        10002     Staff
3        10004  Engineer
6        10005     Staff
9        10007     Staff
12       10009  Engineer
...        ...       ...
443300  499995  Engineer
443301  499996  Engineer
443303  499997  Engineer
443306  499998     Staff
443307  499999  Engineer

[222418 rows x 2 columns]

In [ ]:
# -- 현재 직함에 Senior가 들어가 있는 사원들의 사원번호와 직함을 가져온다.
titles_df.query('to_date=="2222-01-01" and title.str.contains("Senior")')[['emp_no','title']]

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/1281028450.py:2: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  titles_df.query('to_date=="2222-01-01" and title.str.contains("Senior")')[['emp_no','title']]

        emp_no            title
0        10001  Senior Engineer
2        10003  Senior Engineer
4        10004  Senior Engineer
5        10005     Senior Staff
7        10006  Senior Engineer
...        ...              ...
443288  499986     Senior Staff
443296  499992     Senior Staff
443302  499996  Senior Engineer
443304  499997  Senior Engineer
443305  499998     Senior Staff

[167963 rows x 2 columns]

In [ ]:
# -- 현재 직함에 Engineer가 들어가 있는 사원들의 사원번호와 직함을 가져온다.
titles_df.query('to_date=="2222-01-01" and title.str.contains("Engineer")')[['emp_no','title']]

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/4053008748.py:2: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  titles_df.query('to_date=="2222-01-01" and title.str.contains("Engineer")')[['emp_no','title']]

        emp_no            title
0        10001  Senior Engineer
2        10003  Senior Engineer
4        10004  Senior Engineer
7        10006  Senior Engineer
13       10009  Senior Engineer
...        ...              ...
443298  499993         Engineer
443300  499995         Engineer
443302  499996  Senior Engineer
443304  499997  Senior Engineer
443307  499999         Engineer

[120510 rows x 2 columns]

In [45]:
# -- 현재 d001 부서에 근무하고 있는 사원들의 수를 가져온다.
dept_emp_df.query('dept_no == "d001" and to_date == "2222-01-01"')[['emp_no']].count()

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/839078842.py:2: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  dept_emp_df.query('dept_no == "d001" and to_date == "2222-01-01"')[['emp_no']].count()

emp_no    14842
dtype: int64

In [ ]:
# -- first_name이 Georgi인 사원들의 수를 구한다.
employees_df.query('first_name == "Georgi"')[['emp_no']].count()

emp_no    253
dtype: int64

In [ ]:
# -- 1990년대에 고용된 여자 사원들의 수를 구한다.
employees_df.query('hire_date >= "1990-01-01" and hire_date <= "1999-12-31" and gender =="F"')[['emp_no']].count()

emp_no    53832
dtype: int64

In [57]:
# -- 1960년대에 태어난 남자 사원들의 수를 구한다.
employees_df.query('hire_date >= "1960-01-01" and hire_date <= "1969-12-31" and gender =="M"')[['emp_no']].count()

emp_no    0
dtype: int64

In [ ]:
# -- 현재 100000 이상의 급여를 받는 사원들의 급여 평균을 구한다.
salaries_df.query('salary >= 100000 and to_date == "2222-01-01"')[['salary']].mean()

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/2393678164.py:2: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  salaries_df.query('salary >= 100000 and to_date == "2222-01-01"')[['salary']].mean()

salary    109834.577119
dtype: float64

In [ ]:
# -- 현재 100000 미만의 급여를 받는 사람들의 급여 총합을 구한다.
salaries_df.query('salary <= 100000 and to_date == "2222-01-01"')[['salary']].sum()

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/978947804.py:2: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  salaries_df.query('salary <= 100000 and to_date == "2222-01-01"')[['salary']].sum()

salary    15370070858
dtype: int64

In [ ]:
# -- 현재 받고 있는 급여의 최고액과 최저액을 가져온다.
salaries_df.query('to_date == "2222-01-01"')[['salary']].agg(['max', 'min'])

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/3810420143.py:2: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  salaries_df.query('to_date == "2222-01-01"')[['salary']].agg(['max', 'min'])

     salary
max  158220
min   38623

In [ ]:
# -- 현재 d005 부서의 매니저 보다 급여를 많이 받는 사원들의 사원번호와 급여액을 가져온다.
mgr_5 = dept_manager_df.query('to_date == "2222-01-01" and dept_no == "d005"')[['emp_no']].iloc[0]
mgr_5_sal = salaries_df.query('emp_no == @mar_5 and to_date = "2222-01-01"')[['salary']].iloc[0]

# -- 현재 d003 부서에 근무하고 있는 사원들이 현재 받는 급여의 평균보다 더 낮은 급여의 평균을
# -- 받는 부서 번호와 급여 평균을 가져온다. (모든 부서근무와 급여는 현재를 기준으로 한다)
# -- 직함에 Engineer가 들어가는 사원들이 현재 받고 있는 급여의 평균을 가져온다.
# -- 1960년대에 태어난 사람들이 현재 근무하고 있는 부서의 부서이름과 현재 받고 있는 급여액을 가져온다.
# -- 사원들의 모든 정보를 가져온다.
# -- 모든 부서의 정보를 가져온다.
# -- 모든 사원들의 사원 번호와 현재 받고 있는 급여액을 가져온다.
# -- 모든 사원들의 사원 번호와 현재 사용하고 있는 직함 이름을 가져온다.
# -- 모든 사원들의 사원 번호와 현재 근무하고 있는 부서의 번호를 가져온다.
# -- 남자 사원들의 사원번호, 성별, 생년월일 가져온다.
# -- 여자 사원들의 사원번호, 성별, first_name, last_name을 가져온다.
# -- 사원들의 사원번호, first_name, 현재 근무중인 부서의 번호를 가져온다.
# -- 사원들의 사원번호, 입사일, 현재 받고 있는 급여를 가져온다
# -- 사원들의 사원 번호, 현재 근무중인 부서의 이름을 가져온다.
# -- 사원들의 사원 번호, 입사일, 현재 사용중인 직함 이름을 가져온다.
# -- 사원들의 사원번호, 현재 근무 중인 부서 이름, 현재 받고 있는 급여를 가져온다.
# -- 단, 현재 받고 있는 급여가 100000 이상인 사원들의 정보만 가져온다.
# -- 사원들의 사원번호, 현재 근무 중인 부서 이름, 현재 받고 있는 급여를 가져온다.
# -- 단, 현재 근무하고 있는 부서의 번호가 d003인 사원들의 정보만 가져온다.
# -- 사원들의 사원번호, 현재 근무 중인 부서 이름, 현재 사용중인 직함, 현재 받고 있는 급여를 가져온다.
# -- 단, 1990년대에 입사한 사원들의 정보만 가져온다.
# -- Finance 부서에 현재 근무하고 있는 사원들의 사원 번호와 근무 시작일을 가져온다.
# -- 현재 받고 있는 급여의 평균보다 많이 받는 사원들의 사원번호와 현재 근무 중인 부서 번호를 가져온다.
# -- 1990년대에 고용된 사원들의 사원번호와 현재 근무 중인 부서 번호를 가져온다.
# -- 현재 d003 부서에 근무하고 있는 사원들의 현재 급여의 평균액 보다 현재 더 많은 급여를 받는 사원들의
# -- 사원 번호와 first_name을 가져온다(가져올 사원 정보는 전체 사원 데이터 중에 조건에 맞는 것을 가져온다)
# -- 사원번호가 110567 인 매니저 사원과 같은 부서에 현재 근무 하고 있는 사원들의 
# -- 사원번호, first_name, 근무 부서 이름, 현재 받고 있는 급여액을 가져온다
# -- 현재 사용중인 직함이 Senior Engineer인 사원들의 사원번호, first_name, 근무 부서 이름
# -- 현재 받고 있는 급여액을 가져온다.

/var/folders/w3/rml6l6xx3qjc4qvf58x_8ks00000gn/T/ipykernel_4794/3968812977.py:2: FutureWarning: The behavior of 'isin' with dtype=datetime64[ns] and castable values (e.g. strings) is deprecated. In a future version, these will not be considered matching by isin. Explicitly cast to the appropriate dtype before calling isin instead.
  manager_5 = dept_manager_df.query('to_date == "2222-01-01" and dept_no == "d005"')[['emp_no']]

UndefinedVariableError: name 'manager_5' is not defined